# Pandas

## Importação do Pandas

In [1]:
import pandas as pd

## Criando um DataFrame

In [2]:
#vazio
empty_df = pd.DataFrame()
empty_df

Empty DataFrame
Columns: []
Index: []

In [3]:
# a partir de lista de dicionários
from_list_of_dicts_df = pd.DataFrame([
    {'n': 1, 'roman': 'I', 'english': 'one'},
    {'n': 2, 'roman': 'II', 'english': 'two'},
    {'n': 3, 'roman': 'III', 'english': 'three'}
])
from_list_of_dicts_df

   n roman english
0  1     I     one
1  2    II     two
2  3   III   three

In [4]:
# a partir de dicionário de listas
from_dict_of_lists_df = pd.DataFrame({
    'name': ['banana', 'apple', 'cucumber'],
    'color': ['yellow', 'red', 'green']
})
from_dict_of_lists_df

       name   color
0    banana  yellow
1     apple     red
2  cucumber   green

In [5]:
# a partir de arquivos csv (com separador ;)
albums_df = pd.read_csv('albums.csv', sep=';')
tracks_df = pd.read_csv('tracks.csv', sep=';')

In [6]:
albums_df

                          album  year      artist
0                        Meddle  1971  Pink Floyd
1     The Dark Side of the Moon  1973  Pink Floyd
2             The Division Bell  1994  Pink Floyd
3                       Foxtrot  1972     Genesis
4  Selling England by the Pound  1973     Genesis
5                          Duke  1980     Genesis
6                       Fragile  1971         Yes
7             Close to the Edge  1972         Yes

## Selecionando colunas

In [7]:
albums_df['album']

0                          Meddle
1       The Dark Side of the Moon
2               The Division Bell
3                         Foxtrot
4    Selling England by the Pound
5                            Duke
6                         Fragile
7               Close to the Edge
Name: album, dtype: object

In [8]:
albums_df[['album', 'year']]

                          album  year
0                        Meddle  1971
1     The Dark Side of the Moon  1973
2             The Division Bell  1994
3                       Foxtrot  1972
4  Selling England by the Pound  1973
5                          Duke  1980
6                       Fragile  1971
7             Close to the Edge  1972

## Selecionando linhas

In [9]:
albums_df.iloc[0]

album         Meddle
year            1971
artist    Pink Floyd
Name: 0, dtype: object

In [10]:
albums_df.loc[[0, 1]]

                       album  year      artist
0                     Meddle  1971  Pink Floyd
1  The Dark Side of the Moon  1973  Pink Floyd

## Selecionando valores

In [11]:
albums_df['album'].iloc[0]

'Meddle'

In [12]:
albums_df.iloc[0]['album']

'Meddle'

## Operações sobre Series

In [13]:
series1 = pd.Series([1, 1, 2, 3])
series2 = pd.Series([1, 2, 3, 4])

In [14]:
series1 + series2

0    2
1    3
2    5
3    7
dtype: int64

In [15]:
series1 == series2

0     True
1    False
2    False
3    False
dtype: bool

In [16]:
series3 = pd.Series([True, False, True, False])
series4 = pd.Series([True, True, False, False])

In [17]:
series3 & series4

0     True
1    False
2    False
3    False
dtype: bool

In [18]:
(series3 & ~series4) | (~series3 & series4)

0    False
1     True
2     True
3    False
dtype: bool

In [19]:
from math import sqrt
series1.apply(sqrt)

0    1.000000
1    1.000000
2    1.414214
3    1.732051
dtype: float64

In [20]:
series1.apply(lambda n: n ** 2)

0    1
1    1
2    4
3    9
dtype: int64

## Comparação de Series

In [33]:
# Todos os valores são iguais?
(series1 == series2).all()

False

In [34]:
# Algum valor é igual?
(series1 == series2).any()

True

## Filtragem de valores

In [21]:
artist = albums_df['artist']
albums_df[(artist == 'Yes') | (artist == 'Genesis')]

                          album  year   artist
3                       Foxtrot  1972  Genesis
4  Selling England by the Pound  1973  Genesis
5                          Duke  1980  Genesis
6                       Fragile  1971      Yes
7             Close to the Edge  1972      Yes

In [22]:
albums_df[albums_df['year'] == 1973]

                          album  year      artist
1     The Dark Side of the Moon  1973  Pink Floyd
4  Selling England by the Pound  1973     Genesis

## Mesclagem de DataFrames

In [37]:
merged = albums_df.merge(tracks_df, how='inner', on='album')
merged

                album  year      artist  number                 title
0              Meddle  1971  Pink Floyd       1     One of These Days
1              Meddle  1971  Pink Floyd       2     A Pillow of Winds
2              Meddle  1971  Pink Floyd       3              Fearless
3              Meddle  1971  Pink Floyd       4            San Tropez
4              Meddle  1971  Pink Floyd       5                Seamus
..                ...   ...         ...     ...                   ...
59            Fragile  1971         Yes       8        Mood for a Day
60            Fragile  1971         Yes       9  Heart of the Sunrise
61  Close to the Edge  1972         Yes       1     Close to the Edge
62  Close to the Edge  1972         Yes       2         And You and I
63  Close to the Edge  1972         Yes       3       Siberian Khatru

[64 rows x 5 columns]

## Outros recursos

In [35]:
# Ordenação por coluna
albums_df.sort_values('year')

                          album  year      artist
0                        Meddle  1971  Pink Floyd
6                       Fragile  1971         Yes
3                       Foxtrot  1972     Genesis
7             Close to the Edge  1972         Yes
1     The Dark Side of the Moon  1973  Pink Floyd
4  Selling England by the Pound  1973     Genesis
5                          Duke  1980     Genesis
2             The Division Bell  1994  Pink Floyd

In [36]:
# Transposição
albums_df.transpose()

,0,1,2,3,4,5,6,7
album,Meddle,The Dark Side of the Moon,The Division Bell,Foxtrot,Selling England by the Pound,Duke,Fragile,Close to the Edge
year,1971,1973,1994,1972,1973,1980,1971,1972
artist,Pink Floyd,Pink Floyd,Pink Floyd,Genesis,Genesis,Genesis,Yes,Yes

In [43]:
# Agregação
album_count = albums_df.groupby('artist')['album'].count()

In [ ]:
album

## Exportação de dados

In [31]:
albums_df.to_json('out.json')
albums_df.to_csv('out.csv')